PinkFluffyUnic0rn/stm32flight/main.c
		}
	}
			
	
	sprintf(buf, "log finished, %u frames written\r\n", frames);
	dev[ESP_DEV].write(dev[ESP_DEV].priv, buf, strlen(buf));

	return 0;
}

int rcmd(const char **toks)
{
	en = 0.0;
	
	return 0;
}

int ecmd(const char **toks)
{
	en = 1.0;

	return 0;
}

int ccmd(const char **toks)
{
	initstabilize(atof(toks[1]));

	return 0;
}

int infocmd(const char **toks)
{
	char s[INFOLEN];
	
	if (strcmp(toks[1], "mpu") == 0) {
		struct mpu_data md;
		struct qmc_data hd;

		dev[MPU_DEV].read(dev[MPU_DEV].priv, &md,
			sizeof(struct mpu_data));

		dev[QMC_DEV].read(dev[QMC_DEV].priv, &hd,
			sizeof(struct qmc_data));

		md.afx -= st.ax0;
		md.afy -= st.ay0;
		md.afz -= st.az0;

		sprintpos(s, &md, &hd);

		dev[ESP_DEV].write(dev[ESP_DEV].priv, s,
			strlen(s));
	}
	else if (strcmp(toks[1], "qmc") == 0) {
		struct qmc_data hd;

		dev[QMC_DEV].read(dev[QMC_DEV].priv, &hd,
			sizeof(struct qmc_data));

		sprintqmc(s, &hd);	

		dev[ESP_DEV].write(dev[ESP_DEV].priv, s,
			strlen(s));
	}
	else if (strcmp(toks[1], "hp") == 0) {
		float alt;

		alt = dsp_getlpf(&altlpf) - alt0;

		snprintf(s, INFOLEN,
			"temp: %f; alt: %f; climb rate: %f\r\n",
			(double) temp, (double) alt,
			(double) dsp_getcompl(&climbratecompl));

		dev[ESP_DEV].write(dev[ESP_DEV].priv, s,
			strlen(s));
	}
	else if (strcmp(toks[1], "values") == 0) {
		sprintvalues(s);
		dev[ESP_DEV].write(dev[ESP_DEV].priv, s,
			strlen(s));
	}
	else if (strcmp(toks[1], "pid") == 0) {
		sprintpid(s);
		dev[ESP_DEV].write(dev[ESP_DEV].priv, s,
			strlen(s));
	}
	else if (strcmp(toks[1], "gnss") == 0) {
		sprintgnss(s);
		dev[ESP_DEV].write(dev[ESP_DEV].priv, s,
			strlen(s));
	}
	else
		return (-1);

	return 0;
}

int pidcmd(const char **toks)
{
	float v;

	v = atof(toks[3]);

	if (strcmp(toks[1], "tilt") == 0) {
		if (strcmp(toks[2], "mode") == 0) {
			if (strcmp(toks[3], "double") == 0)
				st.speedpid = 0;
			else if (strcmp(toks[3], "single") == 0)
				st.speedpid = 1;
			else
				return (-1);
		}
		else if (strcmp(toks[2], "p") == 0)	st.p = v;
		else if (strcmp(toks[2], "i") == 0)	st.i = v;
		else if (strcmp(toks[2], "d") == 0)	st.d = v;
		else					return (-1);

		dsp_setpid(&pitchpv, st.p, st.i, st.d);
		dsp_setpid(&rollpv, st.p, st.i, st.d);
	}
	else if (strcmp(toks[1], "stilt") == 0) {
		if (strcmp(toks[2], "p") == 0)		st.sp = v;
		else if (strcmp(toks[2], "i") == 0)	st.si = v;
		else if (strcmp(toks[2], "d") == 0)	st.sd = v;
		else					return (-1);

		dsp_setpid(&pitchspv, st.sp, st.si, st.sd);
		dsp_setpid(&rollspv, st.sp, st.si, st.sd);
	}
	else if (strcmp(toks[1], "yaw") == 0) {
		if (strcmp(toks[2], "mode") == 0) {
			if (strcmp(toks[3], "double") == 0)
				st.yawspeedpid = 0;
			else if (strcmp(toks[3], "single") == 0)
				st.yawspeedpid = 1;
			else
				return (-1);
		}
		else if (strcmp(toks[2], "p") == 0)	st.yp = v;
		else if (strcmp(toks[2], "i") == 0)	st.yi = v;
		else if (strcmp(toks[2], "d") == 0)	st.yd = v;
		else					return (-1);

		dsp_setpid(&yawpv, st.yp, st.yi, st.yd);
	}
	else if (strcmp(toks[1], "syaw") == 0) {
		if (strcmp(toks[2], "p") == 0)		st.ysp = v;
		else if (strcmp(toks[2], "i") == 0)	st.ysi = v;
		else if (strcmp(toks[2], "d") == 0)	st.ysd = v;
		else					return (-1);

		dsp_setpid(&yawspv, st.ysp, st.ysi, st.ysd);
	}
	else if (strcmp(toks[1], "climb") == 0) {
		if (strcmp(toks[2], "p") == 0)		st.zsp = v;
		else if (strcmp(toks[2], "i") == 0)	st.zsi = v;
		else if (strcmp(toks[2], "d") == 0)	st.zsd = v;
		else					return (-1);

		dsp_setpid(&tpv, st.zsp, st.zsi, st.zsd);
	}
	else if (strcmp(toks[1], "climbrate") == 0) {
		if (strcmp(toks[2], "p") == 0)		st.cp = v;
		else if (strcmp(toks[2], "i") == 0)	st.ci = v;
		else if (strcmp(toks[2], "d") == 0)	st.cd = v;
		else					return (-1);

		dsp_setpid(&cpv, st.cp, st.ci, st.cd);
	}
	else if (strcmp(toks[1], "altitude") == 0) {
		if (strcmp(toks[2], "p") == 0)		st.ap = v;
		else if (strcmp(toks[2], "i") == 0)	st.ai = v;
		else if (strcmp(toks[2], "d") == 0)	st.ad = v;
		else					return (-1);

		dsp_setpid(&apv, st.ap, st.ai, st.ad);
	}
	else
		return (-1);
	
	return 0;
}

int calibcmd(const char **toks)
{
	if (strcmp(toks[1], "mag") == 0) {
		if (strcmp(toks[2], "on") == 0)
			magcalibmode = 1;
		else if (strcmp(toks[2], "off") == 0)
			magcalibmode = 0;
		else
			return (-1);
	}
	else
		return (-1);

	return 0;
}

int flashcmd(const char **toks)
{
	if (strcmp(toks[1], "write") == 0)
		writesettings(atoi(toks[2]));	
	else if (strcmp(toks[1], "read") == 0)
		readsettings(atoi(toks[2]));
	else
		return (-1);
	
	return 0;
}

int complcmd(const char **toks)
{
	st.tcoef = atof(toks[1]);

	dsp_initcompl(&pitchcompl, st.tcoef, PID_FREQ);
	dsp_initcompl(&rollcompl, st.tcoef, PID_FREQ);	

	return 0;
}

int lpfcmd(const char **toks)
{
	if (strcmp(toks[1], "climb") == 0) {
		st.ttcoef = atof(toks[2]);

		dsp_initlpf(&tlpf, st.ttcoef, PID_FREQ);
	}
	else if (strcmp(toks[1], "climbrate") == 0) {
		st.climbcoef = atof(toks[2]);

		dsp_initcompl(&climbratecompl,
			st.climbcoef, HP_FREQ);
	}
	else if (strcmp(toks[1], "altitude") == 0) {
		st.atcoef = atof(toks[2]);

		dsp_initlpf(&altlpf, st.atcoef, HP_FREQ);
	}
	else
		return (-1);

	return 0;
}

int adjcmd(const char **toks)
{
	float v;

	v = atof(toks[2]);

	if (strcmp(toks[1], "roll") == 0)	st.roll0 = v;
	else if (strcmp(toks[1], "pitch") == 0)	st.pitch0 = v;
	else if (strcmp(toks[1], "yaw") == 0)	st.yaw0 = v;
	else if (strcmp(toks[1], "acc") == 0) {
		if (strcmp(toks[2], "x") == 0)
			st.ax0 = atof(toks[3]);
		else if (strcmp(toks[2], "y") == 0)
			st.ay0 = atof(toks[3]);
		else if (strcmp(toks[2], "z") == 0)
			st.az0 = atof(toks[3]);
	}
	else if (strcmp(toks[1], "gyro") == 0) {
		if (strcmp(toks[2], "x") == 0)
			st.gx0 = atof(toks[3]);
		else if (strcmp(toks[2], "y") == 0)
			st.gy0 = atof(toks[3]);
		else if (strcmp(toks[2], "z") == 0)
			st.gz0 = atof(toks[3]);
	}
	else if (strcmp(toks[1], "mag") == 0) {
		if (strcmp(toks[2], "x0") == 0)
			st.mx0 = atof(toks[3]);
		else if (strcmp(toks[2], "y0") == 0)
			st.my0 = atof(toks[3]);
		else if (strcmp(toks[2], "z0") == 0)
			st.mz0 = atof(toks[3]);
		else if (strcmp(toks[2], "xscale") == 0)
			st.mxsc = atof(toks[3]);
		else if (strcmp(toks[2], "yscale") == 0)
			st.mysc = atof(toks[3]);
		else if (strcmp(toks[2], "zscale") == 0)
			st.mzsc = atof(toks[3]);
		else if (strcmp(toks[2], "decl") == 0)
			st.magdecl = atof(toks[3]);
		else
			return (-1);
	}
	else
		return (-1);

